"""Аня и Боря любят играть в разноцветные кубики, причем у каждого из них свой набор и в каждом наборе все кубики
различны по цвету. Однажды дети заинтересовались, сколько существуют цветов таких, что кубики каждого цвета
присутствуют в обоих наборах. Для этого они занумеровали все цвета случайными числами. На этом их энтузиазм иссяк,
поэтому вам предлагается помочь им в оставшейся части. Номер любого цвета — это целое число в пределах от 0 до 10⁹.
Формат ввода
В первой строке входного файла записаны числа N и M — количество кубиков у Ани и Бори соответственно. В следующих N
строках заданы номера цветов кубиков Ани. В последних M строках  номера цветов кубиков Бори.
Формат вывода
Выведите сначала количество, а затем отсортированные по возрастанию номера цветов таких, что кубики каждого цвета
есть в обоих наборах, затем количество и отсортированные по возрастанию номера остальных цветов у Ани, потом
количество и отсортированные по возрастанию номера остальных цветов у Бори."""
# import sys
# n, m = None, None
# n_num, m_num = set(), set()
# i = 0
# for line in sys.stdin:
#     s = line.split()
#     if n is None:
#         n, m = int(s[0]),  int(s[1])
#     else:
#         if i < n:
#             n_num.add(int(s[0]))
#             i += 1
#         else:
#             m_num.add(int(s[0]))
#
# print(len(n_num & m_num))
# print(*sorted(n_num & m_num))
# print(len(n_num - (n_num & m_num)))
# print(*sorted(n_num - (n_num & m_num)))
# print(len(m_num - (n_num & m_num)))
# print(*sorted(m_num - (n_num & m_num)))

"""Во входном файле (вы можете читать данные из sys.stdin, подключив библиотеку sys) записан текст. Словом считается
последовательность непробельных символов идущих подряд, слова разделены одним или большим числом пробелов или
символами конца строки. Определите, сколько различных слов содержится в этом тексте."""
# import sys
# words = set()
# for line in sys.stdin:
#     s = line.split()
#     for word in s:
#         words.add(word)
# print(len(words))

"""Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n. Беатриса пытается угадать это число, для
этого она называет некоторые множества натуральных чисел. Август отвечает Беатрисе YES, если среди названных ею чисел
есть задуманное или NO в противном случае. После нескольких заданных вопросов Беатриса запуталась в том, какие вопросы
она задавала и какие ответы получила и просит вас помочь ей определить, какие числа мог задумать Август.
Формат ввода
Первая строка входных данных содержит число n — наибольшее число, которое мог загадать Август. Далее идут строки,
содержащие вопросы Беатрисы. Каждая строка представляет собой набор чисел, разделенных пробелами. После каждой строки
с вопросом идет ответ Августа: YES или NO.  Наконец, последняя строка входных данных содержит одно слово HELP.
Формат вывода
Вы должны вывести (через пробел, в порядке возрастания) все числа, которые мог задумать Август."""
# import sys
# numbers = set()
# n_max = None
# for line in sys.stdin:
#     s = line.split()
#     if n_max is None:
#         n_max = int(s[0])
#         numbers = set(i for i in range(1, n_max + 1))
#     else:
#         if s == ['HELP']:
#             print(*sorted(numbers))
#             exit()
#         elif s != ['YES'] and s != ['NO']:
#             input_num = set()
#             for number in s:
#                 input_num.add(int(number))
#         elif s == ['YES']:
#             numbers &= input_num
#         elif s == ['NO']:
#             numbers -= input_num

"""Август и Беатриса продолжают играть в игру, но Август начал жульничать. На каждый из вопросов Беатрисы он выбирает
такой вариант ответа YES или NO, чтобы множество возможных задуманных чисел оставалось как можно больше. Например,
если Август задумал число от 1 до 5, а Беатриса спросила про числа 1 и 2, то Август ответит NO, а если Беатриса
спросит про 1, 2, 3, то Август ответит YES. Если же Бетриса в своем вопросе перечисляет ровно половину из задуманных
чисел, то Август из вредности всегда отвечает NO. Наконец, Август при ответе учитывает все предыдущие вопросы Беатрисы
и свои ответы на них, то есть множество возможных задуманных чисел уменьшается.
Формат ввода
Вам дана последовательность вопросов Беатрисы. Приведите ответы Августа на них. Первая строка входных данных содержит
число n — наибольшее число, которое мог загадать Август. Далее идут строки, содержащие вопросы Беатрисы. Каждая строка
представляет собой набор чисел, разделенных пробелами. Последняя строка входных данных содержит одно слово HELP.
Формат вывода
Для каждого вопроса Беатрисы выведите ответ Августа на этот вопрос. После этого выведите (через пробел, в порядке
возрастания) все числа, которые мог загадать Август после ответа на всевопросы Беатрисы."""
# import sys
# numbers, responses = set(), []
# n_max = None
# for line in sys.stdin:
#     s = line.split()
#     if n_max is None:
#         n_max = int(s[0])
#         numbers = memory = set(i for i in range(1, n_max + 1))
#     else:
#         if s == ['HELP']:
#             for i in responses:
#                 print(i)
#             print(*sorted(numbers))
#             exit()
#         elif s != ['YES'] and s != ['NO']:
#             input_num = set()
#             for number in s:
#                 input_num.add(int(number))
#         if len(input_num & memory) * 2 > len(numbers):
#             numbers &= input_num
#             responses.append('YES')
#         else:
#             numbers -= input_num
#             responses.append('NO')

"""Каждый из N школьников некоторой школы знает Mᵢ языков. Определите, какие языки знают все школьники и языки, которые
знает хотя бы один из школьников.
Формат ввода
Первая строка входных данных содержит количество школьников N. Далее идет N чисел Mᵢ, после каждого из чисел идет
Mᵢ строк, содержащих названия языков, которые знает i-й школьник. Длина названий языков не превышает 1000 символов,
количество различных языков не более 1000. 1≤N≤1000, 1≤Mᵢ≤500.
Формат вывода
В первой строке выведите количество языков, которые знают все школьники. Начиная со второй строки - список таких
языков. Затем - количество языков, которые знает хотя бы один школьник, на следующих строках - список таких языков."""
# n, m_i = int(input()), {input() for _ in range(int(input()))}
# one_language, all_languages = m_i.copy(), m_i.copy()
# for _ in range(1, n):
#     m_i = {input() for _ in range(int(input()))}
#     all_languages |= m_i
#     one_language &= m_i
# for language in [one_language, all_languages]:
#     print(len(language), * language, sep='\n')

"""На Новом проспекте для разгрузки было решено пустить два новых автобусных маршрута на разных участках проспекта.
Известны конечные остановки каждого из автобусов. Определите количество остановок, на  которых можно пересесть с
одного автобуса на другой.
Формат ввода
Вводятся четыре числа, не превосходящие 100, задающие номера конечных остановок. Сначала для первого, потом второго
автобуса (см. примеры и рисунок).
Формат вывода
Ваша программа должна выводить одно число – искомое количество остановок."""
# all = tuple(map(int, input().split()))
# bus1 = set(range(min(all[:2]), max(all[:2]) + 1))
# bus2 = set(range(min(all[2:]), max(all[2:]) + 1))
# print(len(bus1 & bus2))

"""Политическая жизнь одной страны очень оживленная. В стране действует K политических партий, каждая из которых
регулярно объявляет национальную забастовку. Дни, когда хотя бы одна из партий объявляет забастовку, при условии, что
это не суббота или воскресенье (когда и так никто не работает), наносят большой ущерб экономике страны. i-я партия
объявляет забастовки строго каждые bᵢ дней, начиная с дня с номером aᵢ. То есть i-я партия объявляет забастовки в дни
aᵢ, aᵢ+bᵢ, aᵢ+2bᵢ и т.д. Если в какой-то день несколько партий объявляет забастовку, то это считается одной
общенациональной забастовкой. В календаре страны N дней, пронумерованных от 1 до N. Первый день года является
понедельником, шестой и седьмой дни года — выходные, неделя состоит из семи дней.
Формат ввода
Программа получает на вход число дней в году N (1≤N≤10⁶) и число политических партий K (1≤K≤100). Далее идет K строк,
описывающие графики проведения забастовок.i-я строка содержит числа aᵢ и bᵢ (1≤aᵢ,bᵢ≤N).
Формат вывода
Выведите единственное число: количество забастовок, произошедших в течение года.
Примечания
Первая партия объявляет забастовки в дни 2, 5, 8, 11, 14, 17. Вторая партия объявляет забастовки в дни 3, 8, 13, 18.
Третья партия — в дни 9 и 17. Дни номер 6, 7, 13, 14 являются выходными. Таким образом, забастовки пройдут в дни
2, 3, 5, 8, 9, 11, 17, 18."""
# strike_days = set()
# days, k = map(int, input().split())
# for _ in range(k):
#     a, b = map(int, input().split())
#     for day in range(a, days + 1, b):
#         if day not in strike_days and day % 7 != 6 and day % 7 != 0:
#             strike_days.add(day)
#
# print(len(strike_days))

"""Телефонные номера в адресной книге мобильного телефона имеют один из следующих форматов:
- +7<код><номер>
- 8<код><номер>
- <номер>
где <номер> — это семь цифр, а <код> — это три цифры или три цифры в круглых скобках. Если код не указан, то
считается, что он равен 495. Кроме того, в записи телефонного номера может стоять знак “-” между любыми двумя цифрами
(см. пример). На данный момент в адресной книге телефона Васи записано всего три телефонных номера, и он хочет
записать туда еще один. Но он не может понять, не записан ли уже такой номер в телефонной книге. Помогите ему! Два
телефонных номера совпадают, если у них равны коды и равны номера. Например, +7(916)0123456 и 89160123456 — это один
и тот же номер.
Формат ввода
В первой строке входных данных записан номер телефона, который Вася хочет добавить в адресную книгу своего телефона.
В следующих трех строках записаны три номера телефонов, которые уже находятся в адресной книге телефона Васи.
Гарантируется, что каждая из записей соответствует одному из трех приведенных в условии форматов.
Формат вывода
Для каждого телефонного номера в адресной книге выведите YES, если он совпадает с тем телефонным номером,который Вася
хочет добавить в адресную книгу или NO в противном случае."""
# number_save = None
# for _ in range(4):
#     number = input()
#     number_input = ''
#     for symbol in number:
#         if symbol.isdigit():
#             number_input += symbol
#     if len(number_input) == 11:
#         number_input = number_input[-10:]
#     if len(number_input) == 7:
#         number_input = '495' + number_input
#     if number_save is None:
#         number_save = number_input
#     else:
#         if number_save == number_input:
#             print('YES')
#         else:
#             print('NO')

# n_l = []
# for i in range(4):
#     n_l.append(''.join(j for j in input() if j.isdigit()))
#     n_l[i] = "8495" + n_l[i] if len(n_l[i]) == 7 else n_l[i]
# [print(["NO", "YES"][n_l[0][1:] == n_l[i][1:]]) for i in range(1, 4)]

"""Дан список стран и городов каждой страны. Затем даны названия городов. Для каждого города укажите, в какой стране он
находится.
Формат ввода
Программа получает на вход количество стран N. Далее идет N строк, каждая строка начинается с названия страны, затем
идут названия городов этой страны. Название каждого город состоит из одного слова. В следующей строке записано число
M, далее идут M запросов — названия каких-то M городов, перечисленных выше.
Формат вывода
Для каждого из запроса выведите название страны, в котором находится данный город."""
# towns_dict = {}
# for _ in range(int(input())):
#     country, towns = input().split(' ', 1)
#     for town in towns.split():
#         if town not in towns_dict:
#             towns_dict[town.strip()] = country.strip()
# for _ in range(int(input())):
#     town = input().strip()
#     if town in towns_dict:
#         print(towns_dict[town])

"""Во входном файле (вы можете читать данные из файла input.txt) записан текст. Словом считается последовательность
непробельных подряд идущих символов. Слова разделены одним или большим числом пробелов или символами конца строки. Для
каждого слова из этого текста подсчитайте, сколько раз оно встречалось в этом тексте ранее.
Формат ввода - Вводится текст.
Формат вывода - Выведите ответ на задачу."""
# count = {}
# my_input = []
# with open('input.txt') as s:
#     for line in s:
#         my_list = line.split()
#         for word in my_list:
#             if word not in count:
#                 count[word] = 0
#             else:
#                 count[word] += 1
#             my_input.append(count[word])
# print(*my_input)

"""Вам дан словарь, состоящий из пар слов. Каждое слово является синонимом к парному ему слову. Все слова в словаре
различны. Для одного данного слова определите его синоним.
Формат ввода
Программа получает на вход количество пар синонимов N. Далее следует N строк, каждая строка содержит ровно два
слова-синонима. После этого следует одно слово.
Формат вывода
Программа должна вывести синоним к данному слову.
Примечания
Эту задачу можно решить и без словарей (сохранив все входные данные в списке), но решение со словарем будет более
простым."""
# my_dict = {}
# for _ in range(int(input())):
#     word_1, word_2 = input().split()
#     my_dict[word_1] = word_2
#     my_dict[word_2] = word_1
# print(my_dict[input()])

"""Как известно, в США президент выбирается не прямым голосованием, а путем двухуровневого голосования. Сначала
проводятся выборы в каждом штате и определяется победитель выборов в данном штате. Затем проводятся государственные
выборы: на этих выборах каждый штат имеет определенное число голосов — число выборщиков от этого штата. На практике,
все выборщики от штата голосуют в соответствии с результатами голосования внутри штата, то есть на заключительной
стадии выборов в голосовании участвуют штаты, имеющие различное число голосов. Вам известно за кого проголосовал
каждый штат и сколько голосов было отдано данным штатом. Подведите итоги выборов: для каждого из участника голосования
определите число отданных за него голосов.
Формат ввода
Каждая строка входного файла содержит фамилию кандидата, за которого отдают голоса выборщики этого штата, затем через
пробел идет количество выборщиков,отдавших голоса за этого кандидата.
Формат вывода
Выведите фамилии всех кандидатов в лексикографическом порядке,затем через пробел, количество отданных за них голосов."""
# import sys
# my_input = {}
# for line in sys.stdin:
#     family, number = line.split()
#     if family not in my_input:
#         my_input[family] = int(number)
#     else:
#         my_input[family] += int(number)
# for family in sorted(my_input):
#     print(family, my_input[family])

"""Дан текст. Выведите слово, которое в этом тексте встречается чаще всего. Если таких слов несколько, выведите то,
которое меньше в лексикографическом порядке.
Формат ввода - Вводится текст.
Формат вывода - Выведите ответ на задачу."""
# import sys
# my_input, my_out = {}, {}
# for line in sys.stdin:
#     my_list = line.split()
#     for word in my_list:
#         if word not in my_input:
#             my_input[word] = 0
#         my_input[word] += 1
# for key, value in my_input.items():
#     if value not in my_out:
#         my_out[value] = []
#     my_out[value].append(key)
# g = sorted(my_out, reverse=True)[0]
# print(sorted(my_out[g])[0])
#
# import sys
# my_input = {}
# for line in sys.stdin:
#     my_list = line.split()
#     for word in my_list:
#         my_input[word] = my_input[word] + 1 if word in my_input else 1
# print(my_input)
# print(min(my_input.items(), key=lambda x: (-x[1], x[0]))[0])

# words = dict()
# for i in open('input.txt').read().split():
#     words[i] = words[i] + 1 if i in words else 1
# print(min(words.items(), key=lambda x: (-x[1],x[0]))[0])  # это работает более быстрее, так как вместо сортировки
# # всего словаря ищется только один элемент

"""Дан текст. Выведите все слова, встречающиеся в тексте, по одному на каждую строку. Слова должны быть отсортированы по
убыванию их количества появления в тексте, а при одинаковой частоте появления — в лексикографическом порядке.
Указание.
После того, как вы создадите словарь всех слов, вам захочется отсортировать его по частоте встречаемости слова.
Желаемого можно добиться, если создать список, элементами которого будут кортежи из двух элементов: частота
встречаемости слова и само слово. Например, [(2, 'hi'), (1, 'what'), (3, 'is')]. Тогда стандартная сортировка будет
сортировать список кортежей, при этом кортежи сравниваются по первому элементу, а если они равны —то по второму. Это
почти то, что требуется в задаче.
Формат ввода - Вводится текст.
Формат вывода - Выведите ответ на задачу."""
# import sys
# my_input = {}
# for line in sys.stdin:
#     my_list = line.split()
#     for word in my_list:
#         my_input[word] = my_input[word] + 1 if word in my_input else 1
# my_out = sorted(my_input.items(), key=lambda x: (-x[1], x[0]))
# for i in my_out:
#     print(i[0])

"""В выборах Президента Российской Федерации побеждает кандидат, набравший свыше половины числа голосов избирателей.
Если такого кандидата нет, то во второй тур выборов выходят два кандидата, набравших наибольшее число голосов.
Формат ввода
Каждая строка входного файла содержит имя кандидата, за которого отдал голос один избиратель. Известно, что общее
число кандидатов не превосходит 20, но в отличии от предыдущих задач список кандидатов явно не задан. Читайте данные
из файла input.txt с указанием кодировки utf8.
Формат вывода
Если есть кандидат, набравший более 50% голосов, программа должна вывести его имя. Если такого кандидата нет,
программа должна вывести имя кандидата, занявшего первое место, затем имя кандидата, занявшего второе место. Выводите
данные в файл output.txt с указанием кодировки utf8."""
# out_file = open("output.txt", "w", encoding='utf-8')
# input_file = open('input.txt', 'r', encoding='utf-8')
# count, my_input = 0, {}
# for line in input_file:
#     line = line.strip()
#     my_input[line] = my_input[line] + 1 if line in my_input else 1
#     count += 1
# my_out = sorted(my_input.items(), key=lambda x: (-x[1], x[0]))
# print(my_out[0][0], file=out_file)
# if my_out[0][1] * 2 <= count:
#     print(my_out[1][0], file=out_file)
# out_file.close()
# input_file.close()

# outFile = open("output.txt", "w", encoding='utf-8')
# fin = open('input.txt', 'r', encoding='utf-8')
# people = dict()
# count = 0
# for line in fin:
#     people[line.strip()] = people.get(line.strip(), 0) + 1
#     count += 1
# p = sorted(people, key=lambda x: (-people[x], x))
# if people[p[0]] > count / 2:
#     print(p[0], file=outFile)
# else:
#     print(p[0], p[1], sep='\n', file=outFile)
# outFile.close()
# fin.close()

"""Необходимо распределить 450 мест между партиями, участвовавших в выборах. Сначала подсчитывается сумма голосов
избирателей, поданных за каждую партию и подсчитывается сумма голосов, поданных за все партии. Эта сумма делится на
450, получается величина, называемая “первое избирательное частное” (смысл первого избирательного частного - это
количество голосов избирателей, которое необходимо набрать для получения одного места в парламенте). Далее каждая
партия получает столько мест в парламенте, чему равна целая часть от деления числа голосов за данную партию на первое
избирательное частное.Если после первого раунда распределения мест сумма количества мест, отданных партиям, меньше 450
, то оставшиеся места передаются по одному партиям, в порядке убывания дробной части частного от деления числа голосов
за данную партию на первое избирательное частное. Если же для двух партий эти дробные части равны, то преимущество
отдается той партии, которая получила большее число голосов.
Формат ввода
На вход программе подается список партий, участвовавших в выборах. Каждая строка входного файла содержит название
партии (строка, возможно, содержащая пробелы), затем, через пробел, количество голосов, полученных данной партией
– число, не превосходящее 10⁸.
Формат вывода
Программа должна вывести названия всех партий и количество голосов в парламенте, полученных данной партией. Названия
необходимо выводить в том же порядке, в котором они шли во входных данных."""
# import sys
# parties, score = {}, 0
# for line in sys.stdin:
#     name = line.strip().split()
#     parties[' '.join(name[:-1])] = int(name[-1])
#     score += int(name[-1])
# part = score / 450
# parties = [[key, int(parties[key] / part), parties[key] / part -
#             int(parties[key] / part)] for key in parties]
# summa = sum(element[1] for element in parties)
# for element in sorted(parties, key=lambda x: (-x[2], -x[1])):
#     if summa < 450:
#         element[1] += 1
#         summa += 1
#     else:
#         break
# print(*[' '.join(map(str, element[:2])) for element in parties], sep='\n')
#
# d, s, h = {}, 0, 450
# with open('input.txt') as in_file:
#     for line in in_file:
#         d[' '.join(line.split()[:-1])] = int(line.split()[-1])
#         s += int(line.split()[-1])
# d = [[m, int(h * d[m] / s), h * d[m] / s - int(h * d[m] / s)] for m in d]
# print(d)
# overall = sum(party[1] for party in d)
# for party in sorted(d, key=lambda x: (-x[2], -x[1])):
#     if overall == h:
#         break
#     party[1], overall = party[1] + 1, overall + 1
# print(*[' '.join(map(str, party[:2])) for party in d], sep='\n')

"""Дана база данных о продажах некоторого интернет-магазина. Каждая строка входного файла представляет собой запись вида
Покупатель товар количество, где
Покупатель — имя покупателя (строка без пробелов),
товар — название товара (строка без пробелов),
количество — количество приобретенных единиц товара.
Создайте список всех покупателей, а для каждого покупателя подсчитайте количество приобретенных им единиц каждого вида
товаров.
Формат ввода - Вводятся сведения о покупках в указанном формате.
Формат вывода - Выведите список всех покупателей в лексикографическом порядке,после имени каждого покупателя выведите
двоеточие, затем выведите список названий всех приобретенных данным покупателем товаров в лексикографическом порядке,
после названия каждого товара выведите количество единиц товара, приобретенных данным покупателем.Информация о каждом
товаре выводится в отдельной строке."""
# import sys
# base = {}
# for line in sys.stdin:
#     family, product, cost = line.strip().split()
#     base.setdefault(family, {})
#     base[family].setdefault(product, 0)
#     base[family][product] += int(cost)
# for family in sorted(base):
#     print(family + ':')
#     for product in sorted(base[family]):
#         print(product, base[family][product])

"""Некоторый банк хочет внедрить систему управления счетами клиентов, поддерживающую следующие операции:
Пополнение счета клиента.
Снятие денег со счета.
Запрос остатка средств на счете.
Перевод денег между счетами клиентов.
Начисление процентов всем клиентам.
Вам необходимо реализовать такую систему. Клиенты банка идентифицируются именами (уникальная строка, не содержащая
пробелов). Первоначально у банка нет ни одного клиента. Как только для клиента проводится операция пополнения, снятия
или перевода денег, ему заводится счет с нулевым балансом. Все дальнейшие операции проводятся только с этим счетом.
Сумма на счету может быть как положительной, так и отрицательной, при этом всегда является целым числом.
Формат ввода
Входной файл содержит последовательность операций. Возможны следующие операции:
DEPOSIT name sum - зачислить сумму sum на счет клиента name. Если у клиента нет счета, то счет создается.
WITHDRAW name sum - снять сумму sum со счета клиента name. Если у клиента нет счета, то счет создается.
BALANCE name - узнать остаток средств на счету клиента name.
TRANSFER name1 name2 sum - перевести сумму sum со счета клиента name1 на счет клиента name2. Если у какого-либо
клиента нет счета, то ему создается счет.
INCOME p - начислить всем клиентам, у которых открыты счета, p% от суммы счета. Проценты начисляются только клиентам
с положительным остатком на счету, если у клиента остаток отрицательный, то его счет не меняется. После начисления
процентов сумма на счету остается целой, то есть начисляется только целое число денежных единиц. Дробная часть
начисленных процентов отбрасывается.
Формат вывода
Для каждого запроса BALANCE программа должна вывести остаток на счету данного клиента. Если же у клиента с
запрашиваемым именем не открыт счет в банке, выведите ERROR."""
# import sys
# base = {}
# for line in sys.stdin:
#     command, family_summa = line.strip().split(' ', 1)
#     if command in ['DEPOSIT', 'WITHDRAW', 'TRANSFER']:
#         family, summa = family_summa.split(' ', 1)
#         base.setdefault(family, 0)
#         if command == 'DEPOSIT':
#             base[family] += int(summa)
#         elif command == 'WITHDRAW':
#             base[family] -= int(summa)
#         elif command == 'TRANSFER':
#             family_2, summa_transfer = summa.split()
#             base.setdefault(family_2, 0)
#             base[family] -= int(summa_transfer)
#             base[family_2] += int(summa_transfer)
#     elif command == 'BALANCE':
#         print(base.get(family_summa, 'ERROR'))
#     elif command == 'INCOME':
#         for key, value in base.items():
#             if value > 0:
#                 base[key] += int(value * (int(family_summa) / 100))

"""Учительница задала Пете домашнее задание — в заданном тексте расставить ударения в словах, после чего поручила Васе
проверить это домашнее задание. Вася очень плохо знаком с данной темой,поэтому он нашел словарь, в котором указано,
как ставятся ударения в словах. К сожалению, в этом словаре присутствуют не все слова. Вася решил, что в словах,
которых нет в словаре, он будет считать, что Петя поставил ударения правильно, если в этом слове Петей поставлено
ровно одно ударение.
Оказалось, что в некоторых словах ударение может быть поставлено больше, чем одним способом. Вася решил, что в этом
случае если то, как Петя поставил ударение, соответствует одному из приведенных в словаре вариантов, он будет
засчитывать это как правильную расстановку ударения, а если не соответствует, то как ошибку. Вам дан словарь, которым
пользовался Вася и домашнее задание, сданное Петей. Ваша задача — определить количество ошибок,которое в этом задании
насчитает Вася.
Формат ввода
Вводится сначала число N — количество слов в словаре (0≤N≤20000). Далее идет N строк со словами из словаря. Каждое
слово состоит не более чем из 30 символов. Все слова состоят из маленьких и заглавных латинских букв. В каждом слове
заглавная ровно одна буква — та, на которую попадает ударение. Слова в словаре расположены в алфавитном порядке. Если
есть несколько возможностей расстановки ударения в одном и том же слове, то эти варианты в словаре идут в произвольном
порядке.
Далее идет упражнение, выполненное Петей. Упражнение представляет собой строку текста, суммарным объемом не более
300000 символов. Строка состоит из слов, которые разделяются между собой ровно одним пробелом. Длина каждого слова не
превышает 30 символов. Все слова состоят из маленьких и заглавных латинских букв (заглавными обозначены те буквы, над
которыми Петя поставил ударение). Петя мог по ошибке в каком-то слове поставить более одного ударения или не поставить
ударения вовсе.
Формат вывода - Выведите количество ошибок в Петином тексте, которые найдет Вася."""
# with open('input.txt', 'r', encoding='utf-8') as inf:
#     words, lower_words, error = set(), set(), 0
#     n = int(inf.readline())
#     for _ in range(n):
#         word = inf.readline().strip()
#         words.add(word)
#         lower_words.add(word.lower())
#     for word in inf.readline().split():
#         if word not in words:
#             if word.lower() in lower_words:
#                 error += 1
#             elif word.islower():
#                 error += 1
#             elif sum(map(str.isupper, word)) != 1:
#                 error += 1
# print(error)

"""В генеалогическом древе у каждого человека, кроме родоначальника, есть ровно один родитель. Каждом элементу дерева
сопоставляется целое неотрицательное число, называемое высотой. У родоначальника высота равна 0, у любого другого
элемента высота на 1 больше, чем у его родителя.Вам дано генеалогическое древо, определите высоту всех его элементов.
Формат ввода
Программа получает на вход число элементов в генеалогическом древе N. Далее следует N-1 строка, задающие родителя для
каждого элемента древа, кроме родоначальника.Каждая строка имеет вид имя_потомка имя_родителя.
Формат вывода
Программа должна вывести список всех элементов древа в лексикографическом порядке.После вывода имени каждого элемента
необходимо вывести его высоту.
Примечания
Эта задача имеет решение сложности O(n), но вам достаточнонаписать решение сложности O(n²) (не считая сложности
обращенияк элементам словаря).Пример ниже соответствует приведенному древу рода Романовых."""
# def height(child, tree):
#     if child not in tree:
#         return 0
#     return height(tree[child], tree) + 1
#
# with open('input.txt', 'r', encoding='utf-8') as inf:
#     tree, list_all = {}, set()
#     n = int(inf.readline())
#     for _ in range(n - 1):
#         child, parent = inf.readline().split()
#         tree.setdefault(child, parent)
#         list_all.add(child)
#         list_all.add(parent)
# [print(name, height(name, tree)) for name in sorted(list_all)]

# def height(name, d):
#     return 0 if name not in d else height(d[name], d) + 1
# a = {}
# for i in range(1, int(input())):
#     nCh, nPr = input().split()
#     a[nCh] = nPr
# [print(i, height(i, a)) for i in sorted(set(a.keys()) | (set(a.values())))]
